---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SolidOptions
source: html/0c4adb90-a951-bbeb-6243-0aac89cdbad9.htm
---
# SolidOptions Members

Creates a new SolidOptions class with material and graphics style settings.